[{"course_id": "CSE1031", "course_text": "An introduction to basic probability and statistical theories for computer system modeling, performance evaluation, and analysis, including simulations of data analysis."}, {"course_id": "CSE1032", "course_text": "Advanced studies on discrete structures and an introduction to basic linear algebra."}, {"course_id": "CSE2003", "course_text": "This course begins with a description and breakdown of an engineering problem, with an overview of the basic engineering techniques, basic concepts, and computer language programs needed to complete practical projects related to computer engineering."}, {"course_id": "CSE2007", "course_text": "Fundamental principles of combinatorics, basic counting principles, recursion, gene- rating functions, and elementary combina- torial algorithms."}, {"course_id": "CSE2009", "course_text": "Introduction to computer system and computer science and Engineering, how to use computer systems."}, {"course_id": "CSE2035", "course_text": "Introduction to programming in C, syntax, semantics, and structures of C, and problem solving with C in DOS & UNIX environments."}, {"course_id": "CSE3006", "course_text": "Fundamentals of algebraic structures, with applications to computer science and Engineering."}, {"course_id": "CSE3013", "course_text": "Basic hardware structure of PCs, under- standing MS-Windows, Hangul processing, documentation and program development tools under Windows, Windows progra- mming, and an introduction to computer viruses."}, {"course_id": "CSE3015", "course_text": "Introduction to Boolean algebra with switching theory, synthesis and analysis of combinational and sequential logic."}, {"course_id": "CSE3016", "course_text": "Laboratory experiments pertaining to combinational and sequential circuits, basic logic components and flip-flops, MSI logics such as decoder, mux, adder and subtractor, counter, shift registers, ROM, PLA, and PLD devices."}, {"course_id": "CSE3030", "course_text": "Assembly language programming, instru- ction execution and compilation, and memory addressing and input/output processing."}, {"course_id": "CSE3040", "course_text": "JAVA programming: class, Windows programming, component, applet and \nInternet applications, thread, data structure in JAVA, application program including fractal."}, {"course_id": "CSE3080", "course_text": "Arrays, stacks, queues, linked lists, trees, graphs."}, {"course_id": "CSE3081", "course_text": "A survey of the correctness of iterative and recursive algorithms, methods used in designing efficient algorithms, dynamic programming, divide-and-conquer, and the greedy method."}, {"course_id": "CSE4010", "course_text": "An Iintroduction to basic concepts of digital computers, including micro-operations among registers and control logic. Also, elementary features in digital systems are included."}, {"course_id": "CSE4011", "course_text": "Machine organization at the register transfer level, data and control paths of CPUs, microprogrammed and hardwired implementation of the control unit, simple arithmetic units, memory systems and management, basic I/O organization."}, {"course_id": "CSE4050", "course_text": "Syntax and semantics of programming languages, including general programming language constructs, abstract data types, implementation of programming language, as well as logic, functional, and object- oriented programming languages."}, {"course_id": "CSE4060", "course_text": "Basic physical and mathematical concepts for data transmission, including transmission media, data encoding and decoding, and modulations; data link error and flow control; and multiplexing and switching methodologies. Also includes an introduction to computer network architecture."}, {"course_id": "CSE4061", "course_text": "Laboratory experiments pertaining to the basic protocol for data communication, operations, and monitoring of the experimental network."}, {"course_id": "CSE4070", "course_text": "Operating systems’ principles, resource and file management, memory and processor management, dynamic protection and security, and network interface."}, {"course_id": "CSE4085", "course_text": "Finite automata, regular expressions, Turing machines, computable functions, and surveys of other automata."}, {"course_id": "CSE4095", "course_text": "Fundamental file processing operations and file organizations: storage devices, system software, sequential files, external sorting, indexed files, B-tree, multi-key processing, and spatial files."}, {"course_id": "CSE4100", "course_text": "Algorithms and run-time structures of language processors such as assembler, macro processors, linkers and loaders. Also includes an introduction to program development environments and their implementation."}, {"course_id": "CSE4105", "course_text": "Structured design tools, module coupling, transaction division, structured analysis, system descriptive method, optimization and verification required in structured design."}, {"course_id": "CSE4110", "course_text": "Differences with file systems, characteristics of database systems, data models, architectures, relational systems, database design, data protections, and object-oriented systems."}, {"course_id": "CSE4112", "course_text": "Advanced database programming techniques for database design and development, with an emphasis on practical projects for applying the advanced techniques to real applications. "}, {"course_id": "CSE4115", "course_text": "Practical applications in software design and development: software cycle, problem analysis, requirements definition, specification and design, formal programming, testing and verification and methodologies."}, {"course_id": "CSE4116", "course_text": "Advanced system programming and embedded system-programming techniques for embedded system software: kernel programming in OS, techniques for device driver development, and system-call API based techniques. "}, {"course_id": "CSE4120", "course_text": "Compiler construction, syntax, lexical parsing, object code generation and optimization."}, {"course_id": "CSE4140", "course_text": "Floating-point number systems, numerical problems with floating-point arithmetic, stability of numerical computing, source- level and assembler-level code optimization, fixed-point arithmetic and programming on low-end processors, problem solving focu- sing on numerical applications, interpolation and approximation, numerical differentiation and integration, root finding, linear systems, and differential equations."}, {"course_id": "CSE4150", "course_text": "Architecture and operation of a micro- processors, microprocessor instruction sets, assembly language programming examples, microcomputer memory design, input/ output operations, interrupt techniques, serial and parallel I/O, peripheral devices, microprocessors in analog environments, and floating point coprocessors."}, {"course_id": "CSE4152", "course_text": "A practical introduction to methods for managing software development, with an emphasis on programming projects to enhance problem-solving capabilities."}, {"course_id": "CSE4155", "course_text": "Multi-mini and multi-micro computer organization, communication, design, and application on characteristics of intercommunication digital processes."}, {"course_id": "CSE4158", "course_text": "Fundamentals of graph theory, graph related problems and their algorithmic solutions with applications."}, {"course_id": "CSE4170", "course_text": "Fundamental principles of computer graphics, overview of graphics software and hardware, geometrical transformations, viewing and projections, lighting and shading, geometric modeling, fundamental graphics algorithms, and photorealistic image synthesis."}, {"course_id": "CSE4175", "course_text": "Principles of computer networks: architecture, multi-layer protocols. packet switching and routing techniques, radio packets and medium access control, Local Area Networks, frame relay, cell relay, and BISDN/ATM."}, {"course_id": "CSE4176", "course_text": "The essentials of UNIX are covered with the use of high-level programming languages, utilities, and toolkits. Topics include UNIX shells, essential utilities and network security issues, high-level networking, and protocol basics. This course provides students with an opportunity to make the best use of UNIX."}, {"course_id": "CSE4177", "course_text": "Internet principles, HTML programming, socket programming, the World Wide Web, CGI programming, and Java language and programming."}, {"course_id": "CSE4178", "course_text": "Introduction to SoC, design flows, the basic MOS transistor, resistance, capaci- tance, the MOS circuit, circuit design, layout, layout experiments, and advanced HDL programming. Also includes simple hardware design and experiments for understanding SoC. "}, {"course_id": "CSE4179", "course_text": "Windows programming using MS Visual C++: fundamentals in C++, graphics, menu, control, dialogue, and user interface applications."}, {"course_id": "CSE4181", "course_text": "This course helps students who are majoring in engineering and will conduct R&D in S/W area improve the competitiveness of R&D by nurturing the accounting knowledge related to development business including SW economic analysis, cost and accounting related basic knowledge(basic finance analysis), R&D cost management, targeting cost management and technological value evaluation. Students will learn SW area regarding the establishment and control of R&D budget, R&D assignment evaluation, taxation strategy in the startup of the company focusing on SW area and this course will cover the related contents in the form of study focusing on information user not the person in charge of accounting who produces the accounting information regarding basic accounting and cost accounting."}, {"course_id": "CSE4182", "course_text": "Introduction to design patterns and refactoring methods: requirements engineering, software architecture pattern, UML, creational, structural, and behavioral patterns."}, {"course_id": "CSE4183", "course_text": "This course covers the method of specification by steps of SW development process to improve the re-usability. Students in this course study the standardized process of SW development and the phased activities of process and this course covers how the output to be written in each phase will impact on SW quality. In this course, students will study the specification of project proposal, risk assessment, work breakdown structure, high level design, low level design, S/W test plan, low level design, SW test plan, configuration management plan, installation guide, and user manual. "}, {"course_id": "CSE4185", "course_text": "Principle ideas and developments in artificial intelligence, including problem- solving methods, logic and theory, know- ledge, natural language, image understan- ding, and algorithms for nonnumerical data processing."}, {"course_id": "CSE4186", "course_text": "Pre-requisite subject：CSE4100, 4152 This course has a goal of improving the ability to design in a more advanced way based on the theory and concept from math, basic science and profession liberal arts. This course trains students to solve the problem comprehensively in a unit of project by focusing on application development on the smart phone and organizing the team. In this course, students learn the environment setting and programming method required for programming on Android and iOS and conduct the team project focusing on their platform based on systematic development process."}, {"course_id": "CSE4187", "course_text": "This course is a senior-level team project design course that requires the development of a market-oriented S/W product or solution to a real-world computer engineering problem. All projects follow steps in the NPI (New Product Introduction) process: project concept planning, project planning, and design verification."}, {"course_id": "CSE4188", "course_text": "Deals with the mathematics that underlies modern cryptology. Topics include: classical cryptology, public and private key cryptosystems, secret sharing schemes, authentication schemes, linear feedback shift registers, discrete logarithm and elliptic curve-based schemes."}, {"course_id": "CSE4190", "course_text": "An internship is a professionally oriented experience that provides a once in a lifetime opportunity for students to experience the working world while receiving guidance and feedback from their academic advocates. Very often an internship experience is the differentiating factor in a student’s favor when applying for a job upon graduation."}, {"course_id": "CSE4199", "course_text": "In the final semester at the end of their undergraduate program, students should earn 3 credits from a research project in the area of computer science and engineering."}, {"course_id": "CSEG311", "course_text": "This course introduces interactive user interface design method focusing on \nacoustic model with HMM based \nregarding interactive user interface, language model based on the statistics, interactive user interface design method focusing on the search function realization. It introduces the method of audio finger print creation and search and music search, application by using it."}, {"course_id": "CSEG312", "course_text": "This course introduces the concept of data mining deriving the knowledge form data, understand the concept of the mechanic study and algorithm to derive the knowledge and apply to various areas. The concrete themes are correlation analysis, decision making tree, Bayesian inference, support vector machine and clustering."}, {"course_id": "CSEG321", "course_text": "This course introduces how the language is processed and applied to various areas and covers the basic principles of Semantic information search technology and voice talk interface technology through morphological analysis and named entity analysis."}, {"course_id": "CSEG414", "course_text": "This course introduces novel distributed processing programming and algorithm techniques to i) solve the problems, and ii) to apply them to actual applications by using the processing power of several computers, which are connected to the Internet"}, {"course_id": "CSEG437", "course_text": "This course covers the numerical analysis algorithms, which are required to solve numerical calculation problems in various research fields. This course also provides a way how to solve effectively computation-intensive problems through parallel programming over high-performance GPUs."}, {"course_id": "CSEG501", "course_text": "This course introduces the representation mechanism to express multimedia contents, such as, text, images, videos, audio, and music, etc. This course also provides the ways i) how to compress multimedia contents and ii) how to process them in computers. "}, {"course_id": "CSEQ981", "course_text": "This course considers various theories and views on the goal, contents, and evaluation of Computerology course education and analyzes concretely the practical course of Computerology education in the middle and high school. "}, {"course_id": "CSEQ982", "course_text": "This course helps students improve the practical qualification to teach effectively the course of computerology course through the systematic analysis on course of computerology course and text books in the middle and high school and understanding of the theory and practice of computerology teaching method."}, {"course_id": "CSEQ983", "course_text": "This course helps students enhance the thought skill and ability to teach essay with the themes of the contents and principles of computerology based on the understanding of structure and nature of computerology course."}]